#+BEGIN_SRC elisp
(require 'ox-publish)
 ;; Customize the HTML output

(setq org-html-validation-link nil            ;; Don't show validation link
  org-html-head-include-scripts nil       ;; Use our own scripts
  org-html-head-include-default-style t ;; Use our own styles
  org-html-head "<link rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.3/css/all.min.css\"/> 
    <link href=\"https://fonts.googleapis.com/css2?family=roboto:wght@400;500;700&display=swap\" rel=\"stylesheet\">
    <link href=\"https://fonts.googleapis.com/css2?family=roboto+serif:wght@200&display=swap\" rel=\"stylesheet\">
    <link rel=\"stylesheet\" type=\"text/css\" href=\"./assets/css/styles.css\" />
    <link rel=\"icon\" type=\"image/png\" href=\"/favicon.ico\">
    <script type=\"module\" src=\"./assets/js/navbar.js\"></script>")

;; Set Org options to include line breaks and to generate links
(setq org-export-preserve-breaks t)
(setq org-html-doctype "html5")

;; Define the publishing project
(setq org-publish-project-alist
      '(
	   ("go-van-go"
     :recursive t
     :base-directory "~/writing/govango/govango/org/"
     :publishing-function org-html-publish-to-html
      :exclude "build-site\\.org\\|blogs/blog-styles\\.org"
     :base-extension "org"
     :publishing-directory "~/writing/govango/govango/"
     :headline-levels 4
     :auto-preamble t
      :with-toc nil                ;; Include a table of contents
      :with-latex t
      :section-numbers nil       ;; Don't include section numbers
      )
      ))
       ;; Now run org-publish-project to publish
       ;; Generate the site output
       ;;(org-publish-all t)
#+END_SRC

#+RESULTS:
| go-van-go | :recursive | t | :base-directory | ~/writing/govango/govango/org/ | :publishing-function | org-html-publish-to-html | :exclude | build-site\.org\ | blogs/blog-styles\.org | :base-extension | org | :publishing-directory | ~/writing/govango/govango/ | :headline-levels | 4 | :auto-preamble | t | :with-toc | nil | :with-latex | t | :section-numbers | nil |

